[
  {
    "title": "TravelX",
    "desc": "Современный туристический сайт с адаптивным дизайном, интерактивными слайдерами Swiper для отображения направлений и автоматизированной сборкой проекта с использованием Gulp.",
    "tech": ["HTML", "SCSS", "JS", "GULP"],
    "link": "https://wligw.github.io/Travel-X/",
    "github": "https://github.com/wLIGw/Travel-X",
    "img": "img/projects/01.jpg"
  },
  {
    "title": "LoftHouse",
    "desc": "Современный сайт LoftHouse, созданный на чистом JavaScript. Реализован адаптивный дизайн, маска ввода номера телефона с помощью PhoneMask и видеопопапы на базе YouTubeLightbox.",
    "tech": ["HTML", "SCSS", "JS"],
    "link": "https://wligw.github.io/LoftHouse/",
    "github": "https://github.com/wLIGw/LoftHouse",
    "img": "img/projects/02.jpg"
  },
  {
    "title": "StarBucks",
    "desc": "Простой и адаптивный сайт, созданный с использованием HTML и SCSS. В проекте применяются Flexbox и Grid для построения сетки, абсолютное позиционирование элементов и плавная прокрутка к секциям по якорным ссылкам.",
    "tech": ["HTML", "SCSS"],
    "link": "https://wligw.github.io/Starbucks/",
    "github": "https://github.com/wLIGw/Starbucks",
    "img": "img/projects/03.jpg"
  },
  {
    "title": "AirBnB",
    "desc": "Упрощённый клон AirBnB, созданный на React. Проект сфокусирован на переиспользуемых компонентах, структурированном интерфейсе и чистой организации кода. Демонстрирует практические навыки работы с React, включая props, композицию компонентов и динамический рендеринг. Проект не является полностью функциональным, но наглядно показывает уверенное понимание основ React. Макет оптимизирован только под десктоп и не содержит полной мобильной адаптации.",
    "tech": ["REACT", "SCSS", "VITE", "NODE JS"],
    "link": "https://wligw.github.io/AirBnB/",
    "github": "https://github.com/wLIGw/AirBnB",
    "img": "img/projects/04.png"
  },
  {
    "title": "Burger Landing",
    "desc": "Чистый и адаптивный лендинг в бургерной тематике, созданный с использованием чистого HTML и CSS. Проект демонстрирует уверенные базовые навыки: семантическую вёрстку, современные техники стилизации, Flexbox, Grid и полностью адаптивный дизайн. Реализован без использования фреймворков для демонстрации прочного понимания фундаментальных принципов фронтенд-разработки.",
    "tech": ["HTML", "CSS"],
    "link": "https://wligw.github.io/FastFood-Landing/",
    "github": "https://github.com/wLIGw/FastFood-Landing",
    "img": "img/projects/05.jpg"
  },
  {
    "title": "Velocity",
    "desc": "Адаптивный лендинг с таб-секцией, состоящей из трёх кнопок. При нажатии каждая кнопка динамически обновляет отображаемый контент с плавными анимациями. Проект демонстрирует практические навыки работы с DOM, обработкой событий и адаптивным дизайном на чистых HTML, CSS и JavaScript.",
    "tech": ["HTML", "CSS", "JS"],
    "link": "https://wligw.github.io/Velocity/",
    "github": "https://github.com/wLIGw/Velocity",
    "img": "img/projects/06.jpg"
  },
  {
    "title": "Tennis",
    "desc": "Простой трёхстраничный лендинг с hover-эффектами. Создан на чистом HTML и CSS. Проект демонстрирует аккуратную вёрстку, визуальное взаимодействие и грамотную структуру фронтенд-кода. Адаптивность не реализована — акцент сделан на статичный макет и интерактивные эффекты при наведении.",
    "tech": ["HTML", "CSS"],
    "link": "https://wligw.github.io/Tennis/",
    "github": "https://github.com/wLIGw/Tennis",
    "img": "img/projects/07.jpg"
  },
  {
    "title": "Full-Stack E-Commerce Platform",
    "desc": "Полнофункциональный e-commerce сайт, разработанный с нуля под реальные бизнес-задачи. Это коммерческий проект, в рамках которого я отвечал за весь цикл разработки — от идеи и UI/UX-дизайна до полной технической реализации, автоматизации и интеграций.\n\nСайт построен на платформе Creatium, однако из-за ограничений платформы большая часть ключевой логики была реализована с использованием кастомного JavaScript, Make (Integromat) и базы данных на Google Sheets. Система спроектирована как масштабируемая, автоматизированная и удобная для управления нетехническими пользователями.\n\nЯ разработал весь UI/UX с нуля, без шаблонов: структуру страниц, пользовательские сценарии, карточки товаров, слайдер галереи, анимации и интерактивные элементы. Все дизайнерские и UX-решения были созданы и реализованы мной.\n\nРеализованный функционал:\n\n• Полный каталог товаров с категориями и подкатегориями\n• Кастомные карточки товаров, созданные с нуля\n• Слайдер галереи товаров\n• Система избранного, реализованная через автоматизацию Make\n• Кастомная корзина с расширенной формой оформления заказа (имя, email, телефон, способ доставки, адрес доставки)\n• Минимальная сумма заказа — 3000 ₽\n• Динамическая система скидок (от 10k / 50k / 100k ₽), реализованная на кастомном JavaScript\n• Ограничение количества товаров в корзине (нельзя заказать больше, чем есть в наличии)\n• Продвинутый многословный поиск (в Creatium поддерживается только одно слово — полностью переписан)\n• Регистрация и авторизация пользователей\n• Автоматическое управление складом: после покупки остатки обновляются в Google Sheets и мгновенно отображаются на сайте\n• База данных из 150+ страниц в Google Sheets с формулами и логической структурой\n• Интеграция оплаты Robokassa\n• Уведомления о заказах через кастомного Telegram-бота (создан с нуля)\n• Email-уведомления через Make\n• Кастомная система cookie-согласия\n• Попапы и системные уведомления\n• Полная автоматизация заказов и управления складом\n\nПроект является полностью готовым к продакшену e-commerce решением и активно используется реальным бизнесом.",
    "tech": ["GOOGLE SHEETS (DataBase)", "MAKE", "CREATIUM", "HTML", "CSS", "JS"],
    "real": true,
    "link": "https://suvenircrimea.ru/",
    "img": "img/projects/08.png"
  },
  {
    "title": "Business landing",
    "desc": "Высокопроизводительный бизнес-лендинг, разработанный с нуля для компании, предоставляющей одну услугу. В процессе разработки была заложена масштабируемая архитектура, позволяющая расширять сайт и создавать новые посадочные страницы под разные направления услуг на базе одного основного решения (один шаблон → десятки целевых лендингов).\n\nСайт создан на чистых HTML, CSS и JavaScript без использования тяжёлых фреймворков. Архитектура позволяет быстро дублировать и адаптировать страницы под новые услуги, сохраняя единый визуальный стиль, высокую скорость загрузки и сильную SEO-оптимизацию.\n\nВся вёрстка и структура сайта были разработаны с нуля, без шаблонов. Проект полностью адаптивен и оптимизирован под все устройства с использованием CSS Grid и Flexbox.\n\nРеализованные особенности и оптимизации:\n\n• Полностью кастомная вёрстка без шаблонов\n• Адаптивная сетка на CSS Grid и Flexbox\n• Полная адаптация под десктоп, планшеты и мобильные устройства\n• Максимальная оптимизация производительности (Google PageSpeed: 100 / 95 — Desktop / Mobile)\n• Оптимизация изображений\n• Оптимизация шрифтов\n• Минификация и оптимизация JavaScript и CSS\n• Масштабируемая структура для быстрого расширения сайта новыми услугами\n\nРеализованный JavaScript-функционал:\n\n• Адаптивный слайдер услуг на Swiper.js с кастомными брейкпоинтами\n• Модальные окна и галереи на Fancybox\n• Ленивое подключение Яндекс.Карты через IntersectionObserver\n• Интерактивный FAQ-аккордеон с динамическим управлением высотой контента\n• Плавающая кнопка Telegram с продвинутой логикой на основе скролла:\n  - появляется после заданного уровня прокрутки\n  - автоматически смещается при приближении к футеру\n  - привязывается к секции контактов на мобильных устройствах\n• Полная логика поведения интерфейса в зависимости от позиции скролла и размера экрана\n\nПроект создан для реального бизнеса с фокусом на высокую конверсию, максимальную производительность и долгосрочную масштабируемость без необходимости переписывать существующий код.",
    "tech": ["HTML", "CSS", "JS"],
    "real": true,
    "link": "https://wligw.github.io/Business-landing/",
    "img": "img/projects/09.png"
  }
]
